---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.SystemsFailures.FamilyDoesntMatchSystemProperties
source: html/9a174eba-9752-2a68-bf3e-f7aa312e985f.htm
---
# Autodesk.Revit.DB.BuiltInFailures.SystemsFailures.FamilyDoesntMatchSystemProperties Property

The family no longer matches the properties for the System. Disconnect the family from the System?

## Syntax (C#)
```csharp
public static FailureDefinitionId FamilyDoesntMatchSystemProperties { get; }
```